app/Controllers/Buku.php

SELECT *
FROM `kategori`
WHERE `nama_kategori` = 'pendidikan'
 LIMIT 1
INSERT INTO `kategori` (`nama_kategori`) VALUES ('pendidikan')
SELECT *
FROM `penulis`
WHERE `nama_penulis` = 'iis sadiyah'
 LIMIT 1
---
   public function store()
{
    // KATEGORI
$nama_kategori = $this->request->getPost('nama_kategori');
$kategori = $this->kategori->where('nama_kategori', $nama_kategori)->first();
$id_kategori = $kategori ? $kategori['id_kategori'] : $this->kategori->insert(['nama_kategori'=>$nama_kategori]);

// PENULIS
$nama_penulis = $this->request->getPost('nama_penulis');
$penulis = $this->penulis->where('nama_penulis', $nama_penulis)->first();