app/Controllers/Buku.php

    public function index()
{
    $data['buku'] = $this->buku->findAll();
---
SELECT *
FROM `buku`