app/Models/BukuModel.php

SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
---
    public function getAll()
{
    return $this->select('
        buku.*,
        kategori.nama_kategori,
        penulis.nama_penulis,
        penerbit.nama_penerbit
        rak.nama_rak
    ')
    ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
    ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
    ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
    ->join('rak', 'rak.id_rak = buku.id_rak', 'left')
    ->findAll();

SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
---
    public function filter($kategori, $penulis, $penerbit)
    {
        $builder = $this->db->table('buku')
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit')
            ->join('kategori','kategori.id_kategori=buku.id_kategori','left')
            ->join('penulis','penulis.id_penulis=buku.id_penulis','left')
            ->join('penerbit','penerbit.id_penerbit=buku.id_penerbit','left');