app/Models/PeminjamanModel.php

   public function getAll()
{
    return $this->select('peminjaman.*, buku.judul, anggota.nis, petugas.jabatan')
        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
        ->join('petugas', 'petugas.id_petugas = peminjaman.id_petugas')
        ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `anggota`.`nis`, `petugas`.`jabatan`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `petugas` ON `petugas`.`id_petugas` = `peminjaman`.`id_petugas`